Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Arc radius.
it_it: Raggio dell'arco.

source: Arc styles
it_it: Stili per gli Archi

source: Arc thickness.
it_it: Spessore dell'arco.

source: Architectural overview of Renesas GLCDC
it_it: Panoramica dell'architettura di Renesas GLCDC

source: Architecture Support
it_it: Supporto per l'Architettura

source: Arduino Build System
it_it: Sistema di build di Arduino

source: Arduino Display
it_it: Display Arduino

source: Arduino ESP LITTLEFS (a little fail-safe filesystem designed for Arduino ESP)
it_it: Arduino ESP LITTLEFS (un piccolo file system a prova di errore progettato per Arduino ESP)

source: Arduino Example
it_it: Esempio Arduino

source: Arduino SD (allows for reading from and writing to SD cards)
it_it: Arduino SD (consente la lettura e la scrittura su schede SD)

source: Arduino is a great abstraction to solve real problems when it's available for a platform.
it_it: Arduino è un'ottima astrazione per risolvere problemi reali quando è disponibile per una piattaforma.

source: Arduino uses a special build system that automatically compiles:
it_it: Arduino utilizza uno speciale sistema di build che compila automaticamente:

source: Arduino would ignore those files unless they’re inside ``src/``.
it_it: Arduino ignorerebbe questi file a meno che non si trovino all'interno di ``src/``.

source: Arduino: ``lv_tick_set_cb(my_tick_get_cb);``, where ``my_tick_get_cb`` is: ``static uint32_t my_tick_get_cb(void) { return millis(); }``
it_it: Arduino: ``lv_tick_set_cb(my_tick_get_cb);``, dove ``my_tick_get_cb`` è: ``static uint32_t my_tick_get_cb(void) { return millis(); }``

source: Argument must be named in H files as well.
it_it: Anche l'argomento deve essere nominato nei file H.

source: Arguments that contain more than one word or non-alphanumeric characters will cause the :cpp:expr: interpreted-text to fail.
it_it: Gli argomenti che contengono più di una parola o caratteri non alfanumerici causeranno il fallimento dell'interpreted-text :cpp:expr:.

source: Arm Cortex-M55 and Cortex-M85 have the `SIMD Helium <https://www.arm.com/technologies/helium>`__ instruction set.
it_it: Arm Cortex-M55 e Cortex-M85 dispongono del set di istruzioni `SIMD Helium <https://www.arm.com/technologies/helium>`__.

source: Arm is a leading semiconductor and software design company, renowned for creating the Cortex-M microcontroller (MCU) cores and Cortex-A/R (MPU) processor cores, which are integral to a wide range of devices.
it_it: Arm è un'azienda leader nella progettazione di semiconduttori e software, rinomata per aver creato i core dei microcontrollori (MCU) Cortex-M e quelli dei processori Cortex-A/R (MPU), che sono parte integrante di un'ampia gamma di dispositivi.

source: Arm's architecture is highly compatible with various operating systems and software libraries, including LVGL, making it a versatile choice for developers creating efficient, high-performance graphical user interfaces.
it_it: L'architettura di Arm è altamente compatibile con vari sistemi operativi e librerie software, tra cui LVGL, rendendola una scelta versatile per gli sviluppatori che creano interfacce utente grafiche efficienti e ad alte prestazioni.

source: Arm's energy-efficient designs are used in billions of devices worldwide, from microcontrollers to smartphones and servers.
it_it: I progetti a basso consumo energetico di Arm sono utilizzati in miliardi di dispositivi in tutto il mondo, dai microcontrollori agli smartphone e ai server.

source: Arm-2D GPU
it_it: GPU Arm-2D

source: Arm-2D accelerates LVGL9 with two modes: **Synchronous Mode** and **Asynchronous Mode**.
it_it: Arm-2D accelera LVGL9 con due modalità: **Modalità Sincrona** e **Modalità Asincrona**.

source: Arm-2D is an open-source project on GitHub.
it_it: Arm-2D è un progetto open source su GitHub.

source: Arm-2D is not a GPU but **an abstraction layer for 2D GPUs dedicated to Microcontrollers**.
it_it: Arm-2D non è una GPU, ma **un livello di astrazione per GPU 2D dedicato ai microcontrollori**.

source: Arm2D and the Helium instruction set
it_it: Arm2D e il set di istruzioni Helium

source: Arm2D can be downloaded from `https://github.com/ARM-software/Arm-2D <https://github.com/ARM-software/Arm-2D>`__.
it_it: Arm2D può essere scaricato da `https://github.com/ARM-software/Arm-2D <https://github.com/ARM-software/Arm-2D>`__.

source: Arm2D tries to read/write multiple data with a single instruction.
it_it: Arm2D tenta di leggere/scrivere più dati con una singola istruzione.

source: Arrange items in rows with wrap and even spacing
it_it: Disporre gli elementi in righe con "wrap" [riavvolgimento] e spaziatura uniforme

source: Arrays
it_it: Array

source: Arrow buttons
it_it: Pulsanti freccia

source: As Dave2D works in the background, the CPU is free for other tasks.
it_it: Poiché Dave2D lavora in background, la CPU è libera per altre attività.

source: As Image Source
it_it: Come Sorgente Immagine

source: As LVGL can not handle fractional width make sure to round the horizontal resolution to 8 bits (for example 90 to 96).
it_it: Poiché LVGL non può gestire larghezze frazionarie, assicurarsi di arrotondare la risoluzione orizzontale a 8 bit (ad esempio da 90 a 96).

source: As LVGL is MIT licensed, other MIT licensed code can be integrated without issues.
it_it: Poiché LVGL è con licenza MIT, altro codice con licenza MIT può essere integrato senza problemi.

source: As SDL is fully cross-platform, it is easy to integrate into any environment.
it_it: Poiché SDL è completamente multipiattaforma, è facile da integrare in qualsiasi ambiente.

source: As Screens are related to the target hardware in the ``project.xml`` file, multiple ``<display>`` elements can be defined.
it_it: Poiché le schermate sono correlate all'hardware target nel file ``project.xml``, è possibile definire più elementi ``<display>``.

source: As ThorVG is written in C++, when using :c:macro:`LV_USE_THORVG_INTERNAL` be sure that you can compile the cpp files.
it_it: Poiché ThorVG è scritto in C++, quando si utilizza :c:macro:`LV_USE_THORVG_INTERNAL` assicurarsi di poter compilare i file cpp.

source: As `-` is not allowed inside names, it's safe to use as a separator.
it_it: Poiché `-` non è consentito all'interno dei nomi, è sicuro utilizzarlo come separatore.

source: As ``add`` and ``get`` elements return an object, they also have a type.
it_it: Poiché gli elementi ``add`` e ``get`` restituiscono un oggetto, hanno anche un tipo.

source: As a general rule, if you only want to have one LVGL application in your system then it is better to use a static library.
it_it: Come regola generale, se si desidera avere una sola applicazione LVGL nel sistema, è meglio utilizzare una libreria statica.

source: As a reference, some LVGL demos require significantly more than the default allocation.
it_it: A titolo di riferimento, alcune demo LVGL richiedono un'allocazione significativamente superiore a quella di default.

source: As a result, LVGL will know all the ``<view>``\ s, ``<style>``\ s, ``<const>``\ s, etc., i.e., the full content of these XML files needed to create instances later.
it_it: Di conseguenza, LVGL conoscerà tutte le ``<view>``, gli ``<style>``, le ``<const>``, ecc., ovvero il contenuto completo di questi file XML necessario per creare poi delle istanze.

source: As a result, both the visible and virtual resolutions can be incorrect, leading to display problems.
it_it: Di conseguenza, sia la risoluzione visibile che quella virtuale possono essere errate, causando problemi di visualizzazione.

source: As a result, they are not as resource-friendly as images linked at compile time.
it_it: Di conseguenza, non consumano così tante risorse come le immagini linkate in fase di compilazione.

source: As a side effect, this also ensures it is called in a thread in which it is safe to make LVGL calls.
it_it: Come effetto collaterale, questo garantisce anche che venga chiamato in un thread in cui è sicuro effettuare chiamate LVGL.

source: As a side effect, this also ensures that the same Draw Unit will be selected consistently, depending on the type (and nature) of the drawing task, avoiding any possible screen jitter in case more than one Draw Unit is capable of performing a given task type.
it_it: Come effetto collaterale, questo garantisce anche che la stessa Draw Unit venga selezionata in modo coerente, a seconda del tipo (e della natura) del task di disegno, evitando qualsiasi possibile "jitter" [tremolio] dello schermo nel caso in cui più di una Draw Unit sia in grado di eseguire un determinato tipo di attività.

source: As all the children are also created at this point, the saved animation target names are resolved to pointers by using :cpp:expr:`lv_obj_find_by_name`.
it_it: Poiché anche tutti i figli vengono creati a questo punto, i nomi dei target di animazione salvati vengono risolti in puntatori utilizzando :cpp:expr:`lv_obj_find_by_name`.

source: As an example, assume a Source Directory top-level folder name poky, a default Build Directory at poky/build, and a qemux86-poky-linux machine target system.
it_it: Ad esempio, supponiamo una Source Directory di livello superiore denominata poky, una Build Directory predefinita in poky/build e un sistema target qemux86-poky-linux.

source: As an example, assume a Source Directory top-level folder named poky and a default Build Directory at poky/build.
it_it: Ad esempio, si supponga una "Source Directory" di primo livello denominata poky e una "Build Directory" di default in poky/build.

source: As an example, the above scenario with Voltage/Current measurement might look like this:
it_it: Ad esempio, lo scenario sopra descritto con la misurazione di Tensione/Corrente potrebbe apparire così:

source: As children, they can contain Widgets and/or other Components.
it_it: Come elementi figlio, possono contenere Widget e/o altri Componenti.

source: As general rule, the alignment is set to 16 pixels.
it_it: Come regola generale, l'allineamento è impostato su 16 pixel.

source: As mentioned above, a file system is identified by an assigned identifier letter.
it_it: Come accennato in precedenza, un file system è identificato da una lettera identificativa assegnata.

source: As mentioned before, Arm-2D is an abstraction layer for 2D GPU; hence if there is no accelerator or dedicated instruction set (such as Helium or ACI) available for Arm-2D, it provides negligible performance boost for LVGL (sometimes worse) for regular Cortex-M processors.
it_it: Come accennato in precedenza, Arm-2D è un layer di astrazione per GPU 2D; pertanto, se non è disponibile un acceleratore o un set di istruzioni dedicato (come Helium o ACI) per Arm-2D, l'aumento delle prestazioni per LVGL è trascurabile (a volte addirittura peggiore) per i normali processori Cortex-M.

source: As mentioned in :ref:`rpi4_images`, the output image is in ``images`` and named ``sdcard.img``.
it_it: Come menzionato in :ref:`rpi4_images`, l'immagine di output si trova in ``images`` e si chiama ``sdcard.img``.

source: As of 20-Jun-2024, LVGL comes packaged with a Python script (``./scripts/gen_json/gen_json.py``) that reads the header files in LVGL and outputs a more friendly JSON format for the API.
it_it: A partire dal 20 giugno 2024, LVGL viene fornito con uno script Python (``./scripts/gen_json/gen_json.py``) che legge i file header in LVGL e restituisce un formato JSON più intuitivo per l'API.

source: As of LVGL v9.5, the `LV_WAYLAND_WINDOW_DECORATIONS` option has been removed.
it_it: A partire da LVGL v9.5, l'opzione `LV_WAYLAND_WINDOW_DECORATIONS` è stata rimossa.

source: As of e\ |sup2| Studio 2025-04.1 and FSP 6.0.0, LVGL is a managed component.
it_it: A partire da e\ |sup2| Studio 2025-04.1 e FSP 6.0.0, LVGL è un componente gestito.

source: As of this writing, the list of already-available file-system drivers can be enabled by setting one or more of the following macros to a non-zero value in ``lv_conf.h``.
it_it: Al momento della stesura di questo documento, l'elenco dei driver del file system già disponibili può essere abilitato impostando una o più delle seguenti macro su un valore diverso da zero in ``lv_conf.h``.

source: As part of the above call, the Wayland driver will register four input devices for each display:
it_it: Come parte della chiamata precedente, il driver Wayland registrerà quattro dispositivi di input per ciascun display:

source: As shown in the example, parts and states can be set using ``selector``.
it_it: Come mostrato nell'esempio, parti e stati possono essere impostati utilizzando ``selector``.

source: As source, it also accepts images as variables (:cpp:struct:`lv_image_dsc_t`) or files.
it_it: Come sorgente, accetta anche immagini come variabili (:cpp:struct:`lv_image_dsc_t`) o file.

source: As such, they form the "root" of a Widget Tree.
it_it: In quanto tali, costituiscono la "root" [radice] di un "Widget Tree" [Albero dei Widget].

source: As the complexity of the application increases, performance issues such as low FPS and frequent cache misses causing lag may arise.
it_it: Con l'aumentare della complessità dell'applicazione, potrebbero sorgere problemi di prestazioni come bassi FPS e frequenti "cache miss" che causano ritardi.

source: As the example shows, a subject consists of a type, name, and initial value.
it_it: Come mostra l'esempio, un soggetto è costituito da un tipo, un nome e un valore iniziale.

source: As this behavior is tightly related to the last clicked widget, crown support is an extension of the pointer input device.
it_it: Poiché questo comportamento è strettamente correlato all'ultimo widget cliccato, il supporto della corona è un'estensione del dispositivo di input del puntatore.

source: As typically there is only one displays the screen are created on them automatically.
it_it: Poiché in genere è presente un solo display, le schermate vengono create automaticamente.

source: As usual :cpp:func:`lv_obj_set_ext_click_area` can be used to increase the area that will respond to pointer input (touch, mouse, etc.) outside the Arc by a specified number of pixels.
it_it: Come di consueto, :cpp:func:`lv_obj_set_ext_click_area` può essere utilizzato per aumentare di un numero specificato di pixel l'area che risponderà all'input del puntatore (tocco, mouse, ecc.) all'esterno dell'Arco.

source: As usual with format strings, ``%%`` is used to get ``%``.
it_it: Come di consueto con le stringhe di formato, ``%%`` viene utilizzato per ottenere ``%``.

source: As usual, monochrome displays support partial, full, and direct rendering modes as well.
it_it: Come di consueto, i display monocromatici supportano anche le modalità di rendering parziale, completo e diretto.

source: As with Flex containers, the parent Widget must be a Grid container for these styles to take effect.
it_it: Come per i contenitori Flex, il Widget padre deve essere un contenitore Grid affinché questi stili abbiano effetto.

source: As with the e2 Studio plugin, opening the LVGL Editor extension will trigger it to re-scan the Renesas `configuration.xml` file and prompt to update the LVGL project configuration if any relevant settings have changed.
it_it: Come con il plugin e2 Studio, l'apertura dell'estensione LVGL Editor attiverà una nuova scansione del file `configuration.xml` di Renesas e richiederà di aggiornare la configurazione del progetto LVGL se sono state modificate impostazioni rilevanti.

source: As you can see, the value of each of these elements is an array.
it_it: Come si vede, il valore di ciascuno di questi elementi è un array.

source: Aside from enabling the shell you can also use Kconfig to fine-tune the footprint of your application.
it_it: Oltre ad abilitare la shell, è possibile utilizzare Kconfig per ottimizzare il footprint dell'applicazione.

source: Asset Pre-Upload
it_it: Pre-Caricamento delle Risorse

source: Assets
it_it: Risorse

source: Assign Text Area
it_it: Assegnazione dell'Area di Testo

source: Assign a translation tag to a label
it_it: Assegnare un tag di traduzione a un'etichetta

source: Assign the initialized theme to the display.
it_it: Assegnare il tema inizializzato al display.

source: Assuming the above is the case, it is safe to call LVGL functions in
it_it: Supponendo che quanto sopra sia il caso, è sicuro chiamare le funzioni LVGL nelle

source: Asynchronous calls
it_it: Chiamate asincrone

source: At MicroPython: `docs <http://docs.micropython.org/en/latest/>`__ and `forum <https://forum.micropython.org/>`__
it_it: Su MicroPython: `docs <http://docs.micropython.org/en/latest/>`__ e `forum <https://forum.micropython.org/>`__

source: At the end of each of these calls, if the new value differs from the previous value, a notification is sent to all current Observers.
it_it: Al termine di ciascuna di queste chiamate, se il nuovo valore differisce dal valore precedente, viene inviata una notifica a tutti gli Observer correnti.

source: At the same time, the designer is free to work in Figma without constraints.
it_it: Allo stesso tempo, il progettista è libero di lavorare in Figma senza vincoli.

source: At the time of writing, :c:macro:`LV_USE_OS` support is experimental and not yet working in `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__
it_it: Al momento della stesura di questo articolo, il supporto per :c:macro:`LV_USE_OS` è sperimentale e non ancora funzionante in `lv_port_riverdi_stm32u5 <https://github.com/lvgl/lv_port_riverdi_stm32u5>`__

source: At the time of writing, there are several possible values that this field can take, and those values fall into 2 categories:
it_it: Al momento in cui scriviamo, questo campo può assumere diversi valori, suddivisi in due categorie:

source: At the time of writing, this feature is not supported in BSD.
it_it: Al momento della stesura di questo documento, questa funzionalità non è supportata in BSD.

source: At this point, the ``menuconfig`` command should be available:
it_it: A questo punto, il comando ``menuconfig`` dovrebbe essere disponibile:

source: At this point, you have an image that can be flashed on an SD and used.
it_it: A questo punto, si ha un'immagine che può essere flashata su una SD e utilizzata.

source: At this writing, ``@par`` commands do not add additional paragraphs to notes as indicated in the Doxygen documentation.
it_it: Al momento della stesura di questo documento, i comandi ``@par`` non aggiungono paragrafi aggiuntivi alle note, come indicato nella documentazione di Doxygen.

source: At this writing, the online converter supports these formats:
it_it: Al momento della stesura di questo documento, il convertitore online supporta questi formati:

source: Attributes
it_it: Attributi

source: Attribution
it_it: Attribuzione

source: Audio capture from ALSA and PulseAudio devices
it_it: Acquisizione audio da dispositivi ALSA e PulseAudio

source: Aug, 2024
it_it: Ago, 2024

source: Aug, 2025
it_it: Ago, 2025

source: Auto-on that activates when scene movement stops
it_it: Accensione automatica che si attiva all'arresto del movimento della scena

source: Auto-size
it_it: Dimensionamento automatico

source: Autocomplete and syntax highlighting
it_it: Completamento automatico ed evidenziazione della sintassi

source: Automatic input device discovery
it_it: Rilevamento automatico dei dispositivi di input

source: Auxiliary Modules
it_it: Moduli Ausiliari

source: Available "Quick-Access" destinations are:
it_it: Le destinazioni "Quick-Access" disponibili sono:

source: Available anchor points:
it_it: Punti di ancoraggio disponibili:

source: Avoid adding new abbreviations
it_it: Evitare di aggiungere nuove abbreviazioni

source: Axis ticks and labels with scrolling
it_it: Tick degli assi ed etichette con scrolling

source: Axis ticks and labels with scrolling on a chart
it_it: Segni di spunta e etichette degli assi con scorrimento su un grafico

source: BDF Font
it_it: Font BDF

source: BDF are bitmap fonts where fonts are not described in outlines but in pixels.
it_it: I BDF sono font bitmap in cui i font non sono descritti in contorni, ma in pixel.

source: BDF files can be used but they must be converted into the TTF format using ``mkttf``, which can be found in this GitHub repository: https://github.com/Tblue/mkttf .
it_it: È possibile utilizzare file BDF, ma devono essere convertiti in formato TTF utilizzando ``mkttf``, disponibile in questo repository GitHub: https://github.com/Tblue/mkttf .

source: BIN Files
it_it: File BIN

source: BIN: Pixels are transferred line-by-line to the draw buffer.
it_it: BIN: i pixel vengono trasferiti riga per riga al buffer di disegno.

source: BMP Decoder
it_it: Decoder BMP

source: BMP and WEBP Files
it_it: File BMP e WEBP

source: BMP images are currently supported in file form only.
it_it: Le immagini BMP sono attualmente supportate solo in formato file.

source: BMP images as C arrays (:cpp:type:`lv_image_dsc_t`) are not supported.
it_it: Le immagini BMP come array C (:cpp:type:`lv_image_dsc_t`) non sono supportate.

source: BMP: Pixels are transferred directly from the file to the draw buffer.
it_it: BMP: i pixel vengono trasferiti direttamente dal file al buffer di disegno.

source: Back button icon: :ref:`lv_image`
it_it: -__Icona pulsante Back: :ref:`lv_image`

source: Back button: :ref:`lv_button`
it_it: Pulsante Back: :ref:`lv_button`

source: Background (a :ref:`base_widget`, the main window container), is set up to be a Flex-Flow container that flows its contained Widgets vertically (:cpp:enumerator:`LV_FLEX_FLOW_COLUMN`).
it_it: Background (un :ref:`base_widget`, il contenitore della finestra principale), è configurato per essere un contenitore Flex-Flow che distribuisce verticalmente i Widget in esso contenuti (:cpp:enumerator:`LV_FLEX_FLOW_COLUMN`).

source: Background color for selected characters.
it_it: Colore di sfondo per i caratteri selezionati.

source: Background image (an image with its own styles)
it_it: Immagine di sfondo (un'immagine con i propri stili)

source: Background styles
it_it: Stili per il Background

source: Bar
it_it: Barra

source: Bar chart: The typical background properties are used to style the bars.
it_it: Grafico a barre: le tipiche proprietà di sfondo vengono utilizzate per definire lo stile delle barre.

source: Bar with LTR and RTL base direction
it_it: Barra con direzione di base LTR e RTL

source: Bar with opposite direction
it_it: Barra con direzione opposta

source: Base Draw Descriptor
it_it: Descrittore di Disegno di Base

source: Base Widget
it_it: Widget Base

source: Base Widget (lv_obj)
it_it: Widget Base (lv_obj)

source: Base direction for right-to-left text rendering (e.g., Arabic).
it_it: Orientamento di base per la visualizzazione del testo da destra a sinistra (ad esempio, arabo).

source: Base objects with custom styles
it_it: Oggetti base con stili personalizzati

source: Based on these settings LVGL will render an image (either by using its built-in software rendering engine or a GPU) and will call a callback function to show the rendered image on the display.
it_it: In base a queste impostazioni, LVGL creerà un'immagine (utilizzando il suo motore di rendering software nativo o una GPU) e chiamerà una funzione di callback per visualizzare l'immagine renderizzata sul display.

source: Based on this, core utilization is as follows:
it_it: In base a ciò, l'utilizzo dei core è il seguente:

source: Basic Attributes
it_it: Attributi di Base

source: Basic C (or C++) knowledge:
it_it: Conoscenza base del C (o C++):

source: Basic Example
it_it: Esempio di Base

source: Basic Examples
it_it: Esempi di Base

source: Basic GStreamer Player Creation
it_it: Creazione di Base del Player GStreamer

source: Basic Setup Example
it_it: Esempio di Configurazione di Base

source: Basic Usage
it_it: Utilizzo di Base
